# Используем официальный Node.js образ в качестве базового
FROM node:18

# Создаем директорию для приложения внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем весь исходный код в контейнер
COPY . .

# Собираем проект
RUN npm run build

# Сообщаем Docker, что контейнер слушает на порту 5173
EXPOSE 5173

# Запускаем приложение
CMD ["npm", "run", "dev", "--", "--host"]
